
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СсылкаНаФайл") Тогда
        СсылкаНаФайл = Параметры.СсылкаНаФайл;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	ОбъектКопирования = Новый COMОбъект("htmlfile"); 
	ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", СсылкаНаФайл);
	//
	ЭтаФорма.Элементы.Скопировать.Видимость = Ложь;
	ЭтаФорма.Элементы.Скопировано.Видимость = Истина;
	ЭтаФорма.Элементы.Скопировано.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.НадписьСсылкаНаФайл.Заголовок = СсылкаНаФайл;
КонецПроцедуры

&НаКлиенте
Процедура НадписьСсылкаНаФайлНажатие(Элемент)
	ЗапуститьПриложение(СсылкаНаФайл);
КонецПроцедуры
